             CMD        PROMPT('Liste des instances APACHE')
             PARM       KWD(FILE) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Fichier')
             PARM       KWD(LIB ) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Bibliothèque')
