/*-------------------------------------------------------------------*/
/* Variables pour informations LOG                                   */
/*-------------------------------------------------------------------*/
DCL &JOB *CHAR 10
DCL &USR *CHAR 10
DCL &NBR *CHAR 6
DCL &DAT *CHAR 6
DCL &TIM *CHAR 6
