/*-------------------------------------------------------------------*/
/* Déclaration des variables                                         */
/*-------------------------------------------------------------------*/
DCL &LIB *CHAR 10 ('EXPLOIT')
dcl var(&caller) type(*char) len(10)
dcl var(&pgm) type(*char) len(10)
dcl var(&msgkey) type(*char) len(4)
dcl var(&sender) type(*char) len(80)
dcl &dta *char 40
dcl &pgmdep *CHAR 10
