/*--------------------------------------*/
/* Ajout d'un partage de netserver      */
/*--------------------------------------*/
PGM PARM(&SHARE)
DCL VAR(&SHARE) TYPE(*CHAR) LEN(12)
CALL PGM(QSYS/QZLSRMS) PARM(+
   &SHARE +
   X'00000000')
MONMSG CPF0000 EXEC(DO)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Retrait +
                          partage impossible') MSGTYPE(*ESCAPE)
ENDDO
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA('Partage +
                          retiré') MSGTYPE(*COMP)
ENDPGM
