

             CMD        PROMPT('Test convertion PF en table')
             PARM       KWD(FILE) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Fichier PF')
             PARM       KWD(lib) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Bibliothèque')
