             CMD        PROMPT('Gestion menu')
             PARM       KWD(MENU) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Nom du menu')
             PARM       KWD(LIB) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Nom de la bibliothèque')
