             CMD        PROMPT('Référence PGM dans JOBSCDE')
             PARM       KWD(FICHIER) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Fichier de sortie dsppgmref')
             PARM       KWD(BIBLIO) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Bibliothèque du fichier')
