             CMD        PROMPT('Test affichage ecran')
             PARM       KWD(ECRAN) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Nom du Dspf')
             PARM       KWD(format) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Nom du Format')
