             CMD        PROMPT('Historique Volume')
             PARM       KWD(DEVD) TYPE(*NAME) LEN(10) MIN(1) +
                          PROMPT('Unité bande')
             PARM       KWD(MAIL) TYPE(*CHAR) LEN(50) MIN(1) +
                          PROMPT('Email      ')
