pgm (&server &window &descrip)
dcl &server *char 15
dcl &window *char 15
dcl &descrip *char 50
dcl &error   *char 16
CALL QZLSCHSN PARM(&server &window &Descrip &error)
endtcpsvr *netsvr
             DLYJOB     DLY(10)
strtcpsvr *netsvr
             SNDUSRMSG  MSG('Nouveau nom netbios,' *bcat &server) +
                          MSGTYPE(*INFO)
endpgm
